{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Feature evidence listing implemented personalization, gallery, error handling, and image compression changes with linked files and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries for many frontend files describing styling, components, and personalization logic.",
  "frontend/index.css": "Tailwind base layers plus custom OKLCH color variables for light/dark themes and global background/text setup.",
  "frontend/index.html": "HTML entry point mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root component wrapping the Valentine page with theme and toast providers.",
  "frontend/src/components/valentine/animation/HeartConfetti.tsx": "Animated falling heart confetti using randomized particle properties.",
  "frontend/src/components/valentine/animation/ScrollReveal.tsx": "IntersectionObserver-based wrapper that fades and slides content into view.",
  "frontend/src/components/valentine/animation/useMotionSettings.ts": "Hook managing motion preference with localStorage and reduced-motion support.",
  "frontend/src/components/valentine/personalization/defaultContent.ts": "Defines personalization content types and provides default values for text, timeline entries, captions, and photo slots.",
  "frontend/src/components/valentine/personalization/PersonalizeDialog.tsx": "Dialog UI for editing personalization content, handling image uploads, field updates, saving, and resetting with toast feedback.",
  "frontend/src/components/valentine/personalization/usePersonalization.ts": "Hook managing personalization data in localStorage with normalization, update, and reset logic.",
  "frontend/src/components/valentine/sections/ClosingSection.tsx": "Renders the closing message with optional confetti animation and a button to trigger a surprise.",
  "frontend/src/components/valentine/sections/GallerySection.tsx": "Displays a 6‑image gallery using user-uploaded or placeholder images with captions.",
  "frontend/src/components/valentine/sections/HeroSection.tsx": "Hero header showing the recipient's name, intro text, and a themed hero image.",
  "frontend/src/components/valentine/sections/LoveLetterSection.tsx": "Displays the personalized love letter paragraphs inside a styled card.",
  "frontend/src/components/valentine/sections/ReasonsSection.tsx": "Shows a grid of personalized reasons for love, each styled in a card with an icon.",
  "frontend/src/components/valentine/sections/StoryTimelineSection.tsx": "Renders a vertical timeline of relationship milestones from the personalization content.",
  "frontend/src/components/valentine/SurpriseModal.tsx": "Modal displaying a promise message using personalized content and heart-themed visuals.",
  "frontend/src/components/valentine/ValentineNav.tsx": "Fixed navigation bar with scroll detection and smooth scrolling to page sections.",
  "frontend/src/components/valentine/ValentinePage.tsx": "Main page orchestrating sections, personalization dialog with draft state, and surprise modal.",
  "frontend/src/components/valentine/ValentineThemeProvider.tsx": "Wrapper applying heart-pattern background to the whole page.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity, invalidating dependent queries when the actor updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, handling login, logout, stored identities, and auth client configuration.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook for versioned localStorage-backed state with error tracking and automatic persistence.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's prefers-reduced-motion setting and updates reactively.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are used.",
  "frontend/src/index.css": "Tailwind-based global styles defining a romantic color theme, typography, animations, utilities, and custom scrollbars.",
  "frontend/src/main.tsx": "Application entry point wiring up React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/utils/imageResize.ts": "Resizes and compresses image files using canvas to produce smaller JPEG data URLs.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and utilities using custom CSS variables.",
  "project_state.json": "Project metadata describing features, requirements, known issues, and current state for the Valentine’s website."
}